# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# mas '1Password', id: 1333542190
mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id:
# mas 'Numbers', id:
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723 
