# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'node'

# Apps
cask 'aerial'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'google-chat'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Giphy Capture', id: 668208984
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723 
